var namespaces_dup =
[
    [ "Обзор", "a03647.html#autotoc_md29", null ],
    [ "Ключевые особенности", "a03647.html#autotoc_md30", [
      [ "Архитектурные преимущества", "a03647.html#autotoc_md31", null ],
      [ "Уровни логирования", "a03647.html#autotoc_md32", null ],
      [ "Производительность", "a03647.html#autotoc_md33", null ],
      [ "Критические уровни всегда проходят, независимо от пресета", "a03647.html#autotoc_md34", null ],
      [ "Эксплуатационные ограничения и технические риски", "a03647.html#autotoc_md35", null ],
      [ "Расширенные возможности", "a03647.html#autotoc_md36", null ]
    ] ],
    [ "Управление логированием", "a03647.html#autotoc_md37", [
      [ "Включение/отключение логирования", "a03647.html#autotoc_md38", [
        [ "Включение логирования", "a03647.html#autotoc_md39", null ],
        [ "Отключение логирования", "a03647.html#autotoc_md40", null ],
        [ "Изменение имени файла-триггера", "a03647.html#autotoc_md41", null ]
      ] ],
      [ "Настройка уровня логирования", "a03647.html#autotoc_md42", [
        [ "Формат файла конфигурации", "a03647.html#autotoc_md43", null ],
        [ "Поддерживаемые ключи конфигурации", "a03647.html#autotoc_md51", null ]
      ] ]
    ] ],
    [ "Использование в коде", "a03647.html#autotoc_md52", [
      [ "Два слоя макросов", "a03647.html#autotoc_md53", null ],
      [ "Базовые макросы логирования", "a03647.html#autotoc_md54", null ],
      [ "Специализированные макросы", "a03647.html#autotoc_md55", [
        [ "Логирование адресов объектов", "a03647.html#autotoc_md56", null ],
        [ "Логирование объектов с контекстом", "a03647.html#autotoc_md57", null ],
        [ "Логирование с древовидным разбором фреймов", "a03647.html#autotoc_md58", null ]
      ] ],
      [ "Программное управление", "a03647.html#autotoc_md59", null ],
      [ "Буферизация логов", "a03647.html#autotoc_md60", [
        [ "Как работает буферизация (с учетом порядка проверок в <tt>log()</tt>)", "a03647.html#autotoc_md61", null ]
      ] ],
      [ "Пресеты компонентов", "a03647.html#autotoc_md62", null ]
    ] ],
    [ "Формат вывода", "a03647.html#autotoc_md63", [
      [ "Структура сообщения", "a03647.html#autotoc_md64", null ],
      [ "Примеры вывода", "a03647.html#autotoc_md65", null ],
      [ "Маркер сброса буфера", "a03647.html#autotoc_md66", null ],
      [ "Заголовок и завершение лога", "a03647.html#autotoc_md67", null ]
    ] ],
    [ "Файловая структура", "a03647.html#autotoc_md68", null ],
    [ "Практические рекомендации", "a03647.html#autotoc_md69", null ],
    [ "Устранение неполадок", "a03647.html#autotoc_md70", null ],
    [ "DumpTypeUtils", "a01393.html", null ],
    [ "lumex", "a01263.html", "a01263" ],
    [ "std", "a01350.html", null ]
];